In [2]:
import pandas as pd

## 예제 1-4 변수에 할당

In [4]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                  columns=list('abc'))

In [5]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [7]:
df_a = df

In [9]:
df_a

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
id(df), id(df_a)

(908710808656, 908710808656)

In [27]:
df is df_a

True

In [28]:
df_b = df[:]

In [29]:
df_b

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [31]:
df is df_b

False

In [32]:
df.values.base is df_b.values.base

True

In [33]:
df

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [34]:
df_a['a'] = 1000

In [35]:
df_a

      a  b  c
0  1000  2  3
1  1000  5  6
2  1000  8  9

In [36]:
df

      a  b  c
0  1000  2  3
1  1000  5  6
2  1000  8  9

In [77]:
id(df),id(df_a)

(2237706011816, 2237706011816)

In [76]:
df.values.base is df_a.values.base

True

In [37]:
df_b

      a  b  c
0  1000  2  3
1  1000  5  6
2  1000  8  9

In [38]:
id(df),id(df_a),id(df_b)

(908710808656, 908710808656, 908747938280)